Modules/Dashboard/Http/Controllers/RekapMenuController.php

    public function menu_global()
    {
        $waroeng_id = Auth::user()->waroeng_id;
        $data = new \stdClass();
        $data->waroeng_nama = DB::table('m_w')->select('m_w_nama', 'm_w_id')->where('m_w_id', $waroeng_id)->first();
        $data->area_nama = DB::table('m_area')->join('m_w', 'm_w_m_area_id', 'm_area_id')->select('m_area_nama', 'm_area_id')->where('m_w_id', $waroeng_id)->first();
        $data->akses_area = $this->get_akses_area(); //mulai dari 1 - akhir
        $data->akses_pusat = $this->get_akses_pusat(); //1,2,3,4,5
        $data->akses_pusar = $this->get_akses_pusar(); //mulai dari 6 - akhir

        $data->waroeng = DB::table('m_w')
            ->where('m_w_m_area_id', $data->area_nama->m_area_id)
            ->orderby('m_w_id', 'ASC')
            ->get();
        $data->area = DB::table('m_area')
            ->orderby('m_area_id', 'ASC')
            ->get();
        $data->kategori = DB::table('m_jenis_produk')
            ->select('m_jenis_produk_id', 'm_jenis_produk_nama')
            ->orderBy('m_jenis_produk_id', 'asc')
            ->get();
---
select "m_area_nama", "m_area_id" from "m_area" inner join "m_w" on "m_w_m_area_id" = "m_area_id" where "m_w_id" = 1 limit 1
select * from "m_area" order by "m_area_id" asc
select "m_jenis_produk_id", "m_jenis_produk_nama" from "m_jenis_produk" order by "m_jenis_produk_id" asc

    public function export_by_menu(Request $request)
    {
        // return $request->tanggal;
        $menu = DB::table('rekap_transaksi_detail')
            ->join('rekap_transaksi', 'r_t_id', 'r_t_detail_r_t_id')
            ->join('m_w', 'm_w_id', 'r_t_m_w_id')
            ->join('m_produk', 'm_produk_id', 'r_t_detail_m_produk_id')
            ->join('m_jenis_produk', 'm_jenis_produk_id', 'm_produk_m_jenis_produk_id')
            ->join('rekap_modal', 'rekap_modal_id', 'r_t_rekap_modal_id')
            ->where('rekap_modal_status', 'close')
            ->whereIn('m_w_m_w_jenis_id', [1, 2]);
        if (strpos($request->tanggal, 'to') !== false) {
            [$start, $end] = explode('to', $request->tanggal);
            $menu->whereBetween('r_t_tanggal', [$start, $end]);
        } else {
            $menu->where('r_t_tanggal', $request->tanggal);
        }
        if ($request->area != 'all') {
            $menu->where('r_t_m_area_id', $request->area);
            if ($request->waroeng != 'all') {
                $menu->where('r_t_m_w_id', $request->waroeng);
            }
        }
        if ($request->kategori != 'all') {
            $menu->where('m_jenis_produk_id', $request->kategori);
        }
        $menu = $menu->selectRaw('
            sum(r_t_detail_qty) as qty,
            r_t_detail_m_produk_nama,
            m_jenis_produk_nama
        ')
            ->groupBy(
                'r_t_detail_m_produk_nama',
                'm_jenis_produk_nama'
            )
            ->orderby('r_t_detail_m_produk_nama', 'ASC')
            ->get();
---
select
sum(r_t_detail_qty) as qty,
r_t_detail_m_produk_nama,
m_jenis_produk_nama
from "rekap_transaksi_detail" inner join "rekap_transaksi" on "r_t_id" = "r_t_detail_r_t_id" inner join "m_produk" on "m_produk_id" = "r_t_detail_m_produk_id" inner join "m_jenis_produk" on "m_jenis_produk_id" = "m_produk_m_jenis_produk_id" inner join "rekap_modal" on "rekap_modal_id" = "r_t_rekap_modal_id" where "rekap_modal_status" = 'close' and "r_t_m_w_id" not in (2) and "r_t_tanggal" = '2023-11-01' and "r_t_m_area_id" = '1' and "r_t_m_w_id" = '7' and "m_jenis_produk_id" = '1' group by "r_t_detail_m_produk_nama", "m_jenis_produk_nama" order by "r_t_detail_m_produk_nama" asc