Modules/Users/Http/Controllers/UsersController.php

select "waroeng_akses" from "users" where "users_id" = 83 limit 1
select "users"."users_id" as "users_id", "users"."users_status", "users"."name" as "username", "email", "m_w_nama", "roles"."name" as "rolename" from "model_has_roles" right join "users" on "users"."users_id" = "model_id" left join "roles" on "role_id" = "roles"."id" left join "m_w" on "waroeng_id" = "m_w_id" where "waroeng_id" in (36, 45, 44, 39, 48, 49, 38, 47, 41, 37, 40, 42, 43, 46, 51, 50, 71, 75, 74, 77, 78, 79, 82, 81, 70, 72, 73, 76, 80, 58, 62, 65, 66, 60, 59, 54, 53, 52, 61, 55, 56, 57, 63, 64, 67, 68, 69, 84, 91, 92, 93, 98, 85, 86, 89, 87, 99, 97, 88, 100, 94, 83, 95, 96, 90, 118, 106, 109, 101, 102, 105, 108, 104, 107, 103, 112, 113, 110, 114, 115, 111, 3, 2, 1, 5, 4, 116, 117, 18, 21, 11, 25, 17, 6, 8, 7, 10, 9, 12, 13, 14, 15, 16, 19, 20, 22, 23, 26, 24, 31, 32, 29, 35, 33, 34, 30, 27, 28) order by "waroeng_id" asc
---
    public function list_users()
    {
        $data = new \stdClass();
        $users_id = Auth::user()->users_id;
        $waroeng_akses = DB::table('users')->where('users_id', $users_id)->value('waroeng_akses');
        $userRoles = DB::table('model_has_roles')
            ->rightJoin('users', 'users.users_id', 'model_id')
            ->leftJoin('roles', 'role_id', 'roles.id')
            ->leftJoin('m_w', 'waroeng_id', 'm_w_id')
            ->select('users.users_id as users_id', 'users.users_status', 'users.name as username', 'email', 'm_w_nama', 'roles.name as rolename')
            ->whereIn('waroeng_id',json_decode($waroeng_akses))
            ->orderBy('waroeng_id', 'asc')
            ->get();