Modules/Master/Http/Controllers/MWaroengController.php

    public function get_mw_akses()
    {
        $user_id = Auth::user()->users_id;
        $get_waroeng_akses = DB::table('users')->where('users_id', $user_id)->select('waroeng_akses')->first();
---
select "waroeng_akses" from "users" where "users_id" = 83 limit 1