Modules/Akuntansi/Http/Controllers/AkunBankController.php

select "m_akun_bank_id", "m_akun_bank_name", "m_akun_bank_m_rekening_id" from "m_akun_bank" order by "m_akun_bank_id" asc
---
    public function index()
    {
        $data = DB::table('m_akun_bank')->select('m_akun_bank_id', 'm_akun_bank_name', 'm_akun_bank_m_rekening_id')->orderby('m_akun_bank_id', 'asc')->get();

select m_akun_bank_name, m_akun_bank_m_rekening_id from "m_akun_bank" where  LOWER(m_akun_bank_name) ='cash' and m_akun_bank_m_rekening_id ='1'
---
                $ii = Str::lower($request->m_akun_bank_name);
                $trim = trim(preg_replace(array('/\s{2,}/', '/[\t\n]/'), ' ', $ii));
                $ss = $request->m_akun_bank_m_rekening_id;
                $validate = DB::table('m_akun_bank')->selectRaw('m_akun_bank_name, m_akun_bank_m_rekening_id')->whereRaw(' LOWER(m_akun_bank_name) =' . "'$trim'")->whereRaw('m_akun_bank_m_rekening_id =' . "'$ss'")->get();

update "m_akun_bank" set "m_akun_bank_name" = 'cash', "m_akun_bank_m_rekening_id" = '1', "m_akun_bank_client_target" = DEFAULT, "m_akun_bank_updated_by" = 83, "m_akun_bank_updated_at" = '2023-11-07 16:09:47' where "m_akun_bank_id" = '1'
---
                    'm_akun_bank_updated_at' => Carbon::now(),
                );
                if (!empty($validate)) {
                    DB::table('m_akun_bank')->where('m_akun_bank_id', $request->id)
                        ->update($data);