Modules/Akuntansi/Http/Controllers/JurnalBankController.php

select "m_area_nama", "m_area_id" from "m_area" inner join "m_w" on "m_w_m_area_id" = "m_area_id" where "m_w_id" = 1 limit 1
select * from "m_area" order by "m_area_id" asc
select "m_rekening_nama" from "m_rekening" group by "m_rekening_nama" order by "m_rekening_nama" asc
select * from "m_akun_bank" where "m_akun_bank_type"::text LIKE '%bank%'
---
    public function index()
    {
        $data = new \stdClass();
        $waroeng_id = Auth::user()->waroeng_id;
        $data->waroeng_nama = DB::table('m_w')->select('m_w_nama', 'm_w_id')->where('m_w_id', $waroeng_id)->first();
        $data->area_nama = DB::table('m_area')->join('m_w', 'm_w_m_area_id', 'm_area_id')->select('m_area_nama', 'm_area_id')->where('m_w_id', $waroeng_id)->first();
        $data->akses_area = $this->get_akses_area(); //mulai dari 1 - akhir
        $data->akses_pusat = $this->get_akses_pusat(); //1,2,3,4,5
        $data->akses_pusar = $this->get_akses_pusar(); //mulai dari 6 - akhir

        $data->area = DB::table('m_area')
            ->orderby('m_area_id', 'ASC')
            ->get();

        $data->waroeng = DB::table('m_w')
            ->join('m_area', 'm_area_id', 'm_w_m_area_id')
            ->select('m_w_id', 'm_w_nama', 'm_area_id', 'm_area_nama')
            ->orderby('m_w_id', 'asc')
            ->get();
        $data->kategori_akun = DB::table('m_rekening')
            ->select('m_rekening_nama')
            ->orderBy('m_rekening_nama', 'asc')
            ->groupby('m_rekening_nama')
            ->get();
        $data->daftar_bank = DB::table('m_akun_bank')
            ->where('m_akun_bank_type', 'LIKE', '%bank%')
            ->get();

select "m_rekening_code", "m_rekening_id", "m_rekening_nama" from "m_rekening" where "m_rekening_m_w_id" is null order by "m_rekening_code" asc
---
    public function rekeninglink(Request $request)
    {
        $list2 = DB::table('m_rekening')
            ->select('m_rekening_code', 'm_rekening_id', 'm_rekening_nama')
            ->where('m_rekening_m_w_id', $request->filwaroeng)
            ->orderBy('m_rekening_code', 'asc')
            ->get();

select "r_j_b_id", "r_j_b_m_rekening_code", "r_j_b_m_rekening_nama", "r_j_b_particul", "r_j_b_debit", "r_j_b_kredit", "r_j_b_users_name", "r_j_b_transaction_code", "r_j_b_m_w_code", "r_j_b_m_w_nama" from "rekap_jurnal_bank" where "r_j_b_m_w_id" = '4' and "r_j_b_status" = 'in' and "r_j_b_tanggal" = '2023-11-08' order by "r_j_b_id" desc
---
    public function tampil(Request $request)
    {
        $tanggal = $request->r_j_b_tanggal;
        $data = DB::table('rekap_jurnal_bank')
            ->select('r_j_b_id', 'r_j_b_m_rekening_code', 'r_j_b_m_rekening_nama', 'r_j_b_particul', 'r_j_b_debit', 'r_j_b_kredit', 'r_j_b_users_name', 'r_j_b_transaction_code', 'r_j_b_m_w_code', 'r_j_b_m_w_nama')
            ->where('r_j_b_m_w_id', $request->r_j_b_m_w_id)
            ->where('r_j_b_status', $request->r_j_b_status)
            ->where('r_j_b_tanggal', $tanggal)
            ->orderBy('r_j_b_id', 'DESC')
            ->get();

select "m_rekening_nama", "m_rekening_code", "m_rekening_id" from "m_rekening" where "m_rekening_item" is null or m_rekening_item LIKE '%%' limit 1
---
    public function item(Request $request)
    {
        $item = DB::table('m_rekening')
            ->select('m_rekening_nama', 'm_rekening_code', 'm_rekening_id')
            ->where('m_rekening_item', '=', $request->item_produk)
            ->orWhereRaw('m_rekening_item LIKE ?', ['%' . $request->item_produk . '%'])
            ->first();

select "m_rekening_code", "m_rekening_item" from "m_rekening" where "m_rekening_m_w_id" = '1' order by "m_rekening_code" asc
---
    public function list_item(Request $request)
    {
        $list_item = DB::table('m_rekening')
            ->select('m_rekening_code', 'm_rekening_item')
            ->where('m_rekening_m_w_id', $request->filwaroeng)
            ->orderBy('m_rekening_code', 'asc')
            ->get();