Modules/Akuntansi/Http/Controllers/JurnalUmumController.php

    public function index()
    {
        $data = new \stdClass();
        $waroeng_id = Auth::user()->waroeng_id;
        $data->waroeng_nama = DB::table('m_w')->select('m_w_nama', 'm_w_id')->where('m_w_id', $waroeng_id)->first();
        $data->area_nama = DB::table('m_area')->join('m_w', 'm_w_m_area_id', 'm_area_id')->select('m_area_nama', 'm_area_id')->where('m_w_id', $waroeng_id)->first();
        $data->akses_area = $this->get_akses_area(); //mulai dari 1 - akhir
        $data->akses_pusat = $this->get_akses_pusat(); //1,2,3,4,5
        $data->akses_pusar = $this->get_akses_pusar(); //mulai dari 6 - akhir

        $data->area = DB::table('m_area')
            ->orderby('m_area_id', 'ASC')
            ->get();
        $data->waroeng = DB::table('m_w')
            ->join('m_area', 'm_area_id', 'm_w_m_area_id')
            ->select('m_w_id', 'm_w_nama', 'm_area_id', 'm_area_nama')->get();
        $data->rekening = DB::table('m_rekening')
            ->select('m_rekening_kategori', 'm_rekening_code', 'm_rekening_item')
            ->orderBy('m_rekening_code', 'asc')
            ->get();
---
select "m_area_nama", "m_area_id" from "m_area" inner join "m_w" on "m_w_m_area_id" = "m_area_id" where "m_w_id" = 1 limit 1
select * from "m_area" order by "m_area_id" asc
select "m_rekening_kategori", "m_rekening_code", "m_rekening_item" from "m_rekening" order by "m_rekening_code" asc

    public function rekeninglink(Request $request)
    {
        $list2 = DB::table('m_rekening')
            ->select('m_rekening_code', 'm_rekening_id', 'm_rekening_nama')
            ->orderBy('m_rekening_code', 'asc')
            ->get();
---
select "m_rekening_code", "m_rekening_id", "m_rekening_nama" from "m_rekening" order by "m_rekening_code" asc

    public function carijurnalnamaakun(Request $request)
    {
        $norek = DB::table('m_rekening')
            ->select('m_rekening_code')
            ->where('m_rekening_id', $request->m_rekening_nama)
            ->first();
---
select "m_rekening_code" from "m_rekening" where "m_rekening_id" = '38' limit 1

    public function tampil(Request $request)
    {
        $tanggal = $request->r_j_u_tanggal;
        $data = DB::table('rekap_jurnal_umum')
            ->select('r_j_u_id', 'r_j_u_m_rekening_code', 'r_j_u_m_rekening_nama', 'r_j_u_particul', 'r_j_u_debit', 'r_j_u_kredit', 'r_j_u_users_name', 'r_j_u_transaction_code')
            ->where('r_j_u_m_w_id', $request->r_j_u_m_w_id)
            ->where('r_j_u_tanggal', $tanggal)
            ->orderBy('r_j_u_id', 'DESC')
            ->get();
---
select "r_j_u_id", "r_j_u_m_rekening_code", "r_j_u_m_rekening_nama", "r_j_u_particul", "r_j_u_debit", "r_j_u_kredit", "r_j_u_users_name", "r_j_u_transaction_code" from "rekap_jurnal_umum" where "r_j_u_m_w_id" = '1' and "r_j_u_tanggal" = '2023-11-08' order by "r_j_u_id" desc

    public function generatecode($prefix1, $prefix2)
    {
        $tanggal = date('Y-m-d', strtotime($prefix1));
        $code2 = date('Y/m/d');
        $cek_data = DB::table('rekap_jurnal_umum')
            ->join('m_w', 'm_w_id', 'r_j_u_m_w_id')
            ->select('r_j_u_transaction_code')
            ->where('r_j_u_m_w_id', $prefix2)
            ->whereDate('r_j_u_tanggal', $tanggal)
            ->orderby('r_j_u_id', 'DESC');

        if ($cek_data->count() == 0) {
            $code3 = '100001';
        } else {
            $toconv = $cek_data->first();
---
select count(*) as aggregate from "rekap_jurnal_umum" inner join "m_w" on "m_w_id" = "r_j_u_m_w_id" where "r_j_u_m_w_id" = '1' and "r_j_u_tanggal"::date = '2023-11-08'
select "r_j_u_transaction_code" from "rekap_jurnal_umum" inner join "m_w" on "m_w_id" = "r_j_u_m_w_id" where "r_j_u_m_w_id" = '1' and "r_j_u_tanggal"::date = '2023-11-08' order by "r_j_u_id" desc limit 1

    public function simpan(Request $request)
    {
        $validator = Validator::make($request->all(), [
            'r_j_u_m_rekening_code.*' => 'required',
            'r_j_u_m_rekening_nama.*' => 'required',
            'r_j_u_tanggal' => 'after:yesterday',
            'r_j_u_particul.*' => 'required',
        ]);

        if ($validator->passes()) {
            foreach ($request->r_j_u_particul as $key => $value) {
                $rekening = DB::table('m_rekening')
                    ->select('m_rekening_code', 'm_rekening_nama', 'm_rekening_id')
                    ->where('m_rekening_id', '=', $request->r_j_u_m_rekening_nama[$key])
                    ->first();
---
select "m_rekening_code", "m_rekening_nama", "m_rekening_id" from "m_rekening" where "m_rekening_id" = '38' limit 1

                    'r_j_u_created_at' => Carbon::now(),
                );

                DB::table('rekap_jurnal_umum')->insert($data);
---
insert into "rekap_jurnal_umum" ("r_j_u_id", "r_j_u_m_w_id", "r_j_u_m_w_code", "r_j_u_m_w_nama", "r_j_u_m_area_id", "r_j_u_m_area_nama", "r_j_u_tanggal", "r_j_u_m_rekening_id", "r_j_u_m_rekening_code", "r_j_u_m_rekening_nama", "r_j_u_debit", "r_j_u_kredit", "r_j_u_particul", "r_j_u_users_name", "r_j_u_transaction_code", "r_j_u_created_by", "r_j_u_created_at") values ('RJU.1.9.83.231108095422.1', '1', '001', 'kantor pusat', '9', 'pusat', '2023-11-08', 38, '001.04.005', 'pendapatan penjualan - wbd', '90000', '0', 'produksi', 'rendy rachim', '2023/11/08-100001', 83, '2023-11-08 09:54:22')