Modules/Akuntansi/Http/Controllers/RekeningController.php

select "m_kategori_rekening_name", "m_rekening_code", "m_rekening_nama", "m_rekening_saldo" from "m_rekening" inner join "m_kategori_rekening" on "m_kategori_rekening_id" = "m_rekening_m_kategori_rekening_id" order by "m_rekening_id" desc
select * from "m_kategori_rekening" order by "m_kategori_rekening" asc
---
    public function index(Request $request)
    {
        $data = new \stdClass();
        $data->waroeng = DB::table('m_w')
            ->orderby('m_w_id', 'ASC')
            ->get();
        $data->rekening = DB::table('m_rekening')
            ->join('m_kategori_rekening','m_kategori_rekening_id','m_rekening_m_kategori_rekening_id')
            ->select('m_kategori_rekening_name', 'm_rekening_code', 'm_rekening_nama', 'm_rekening_saldo')
            ->orderBy('m_rekening_id', 'DESC')
            ->get();
        $data->kategori_rekening = DB::table('m_kategori_rekening')->orderBy('m_kategori_rekening','asc')->get();

select * from "m_rekening" inner join "m_kategori_rekening" on "m_kategori_rekening_id" = "m_rekening_m_kategori_rekening_id" where "m_kategori_rekening_id" is null and "m_rekening_m_w_id" = '1' order by "m_rekening_code" asc
---
    public function tampil(Request $request)
    {
        $get = DB::table('m_rekening')
            ->join('m_kategori_rekening','m_kategori_rekening_id','m_rekening_m_kategori_rekening_id')
            ->where('m_kategori_rekening_id', $request->m_rekening_kategori)
            ->where('m_rekening_m_w_id', $request->m_rekening_m_waroeng_id)
            ->orderBy('m_rekening_code', 'ASC')
            ->get();

select count(*) as aggregate from "m_rekening" where "m_rekening_nama" is null and "m_rekening_m_w_id" = '1'
---
    public function validasinama(Request $request)
    {
        $validasi = DB::table('m_rekening')
            ->where('m_rekening_nama', $request->m_rekening_nama)
            ->where('m_rekening_m_w_id', $request->m_rekening_m_waroeng_id)
            ->count();

select count(*) as aggregate from "m_rekening" where "m_rekening_code" is null and "m_rekening_m_w_id" = '1'
---
    public function validasino(Request $request)
    {
        $validasi = DB::table('m_rekening')
            ->where('m_rekening_code', $request->m_rekening_code)
            ->where('m_rekening_m_w_id', $request->m_rekening_m_waroeng_id)
            ->count();

insert into "m_rekening" ("m_rekening_id", "m_rekening_m_w_id", "m_rekening_m_w_code", "m_rekening_kategori", "m_rekening_code", "m_rekening_nama", "m_rekening_saldo", "m_rekening_item", "m_rekening_created_by", "m_rekening_created_at") values (120, '007', '007', 'aktiva lancar', '05.009', 'selisih kasir', 0, '12', 83, '2023-11-08 10:13:44')
---
    public function copyrecord(Request $request)
    {
        $get_data = DB::table('m_rekening')
            ->where('m_rekening_m_waroeng_id', $request->waroeng_asal)
            ->get();
        foreach ($get_data as $key) {
            $get_data2 = DB::table('m_rekening')
                ->where('m_rekening_m_waroeng_id', $request->waroeng_tujuan)
                ->where('m_rekening_m_kategori_rekening_id', $key->m_rekening_kategori)
                ->where('m_rekening_code', $key->m_rekening_code)
                ->where('m_rekening_nama', $key->m_rekening_nama)
                ->first();
            if (empty($get_data2)) {
                $saldo = ($request->m_rekening_copy_saldo == 'tidak') ? 0 : $key->m_rekening_saldo;
                $data = array(
                    'm_rekening_id' => $this->getMasterId('m_rekening'),
                    'm_rekening_m_waroeng_id' => $request->waroeng_tujuan,
                    'm_rekening_m_kategori_rekening_id' => $key->m_rekening_kategori,
                    'm_rekening_code' => $key->m_rekening_code,
                    'm_rekening_nama' => $key->m_rekening_nama,
                    'm_rekening_saldo' => $saldo,
                    'm_rekening_created_by' => Auth::user()->users_id,
                    'm_rekening_created_at' => Carbon::now(),
                );
                DB::table('m_rekening')->insert($data);

select "m_rekening_code", "m_rekening_nama" from "m_rekening" where "m_rekening_code" = '01.002' limit 1
---
    public function edit($id)
    {
        $data = DB::table('m_rekening')->select('m_rekening_code', 'm_rekening_nama')->where('m_rekening_code', $id)->first();

select count(*) as aggregate from "rekap_jurnal_kas" where "r_j_k_m_rekening_code" = '01.002'
select count(*) as aggregate from "rekap_jurnal_bank" where "r_j_b_m_rekening_code" = '01.002'
select count(*) as aggregate from "rekap_jurnal_umum" where "r_j_u_m_rekening_code" = '01.002'
select count(*) as aggregate from "m_rekening" where "m_rekening_code" = '01.002'
select count(*) as aggregate from "m_rekening" where "m_rekening_nama" = 'bank'
---
    public function simpan_edit(Request $request)
    {
        $rekening_old = $request->id;
        $validasi1 = DB::table('rekap_jurnal_kas')
            ->select('r_j_k_m_rekening_code')
            ->where('r_j_k_m_rekening_code', $request->m_rekening_code)
            ->count();

        $validasi2 = DB::table('rekap_jurnal_bank')
            ->select('r_j_b_m_rekening_code')
            ->where('r_j_b_m_rekening_code', $request->m_rekening_code)
            ->count();

        $validasi3 = DB::table('rekap_jurnal_umum')
            ->select('r_j_u_m_rekening_code')
            ->where('r_j_u_m_rekening_code', $request->m_rekening_code)
            ->count();

        $validasi4 = DB::table('m_rekening')
            ->select('m_rekening_code')
            ->where('m_rekening_code', $request->m_rekening_code)
            ->count();

        $validasi5 = DB::table('m_rekening')
            ->select('m_rekening_code')
            ->where('m_rekening_nama', $request->m_rekening_nama1)
            ->count();

select * from "m_rekening" where "m_rekening_code" = '01.005' limit 1
update "m_rekening" set "m_rekening_item" = 'lalala po' where "m_rekening_code" = '01.005'
---
    public function simpan_item(Request $request)
    {
        $id_rekening = $request->id;
        $newItem = $request->item;

        $rekening = DB::table('m_rekening')->where('m_rekening_code', $id_rekening)->first();

        if ($rekening) {
            $existingItems = $rekening->m_rekening_item;

            if ($newItem !== null && $newItem !== '') {
                // Menambahkan string baru ke data yang ada
                if (empty($existingItems)) {
                    $updatedItems = $newItem;
                } else {
                    $updatedItems = $existingItems . ',' . $newItem;
                }
            } else {
                // Jika $newItem kosong atau null, maka tidak ada perubahan
                $updatedItems = $existingItems;
            }

            DB::table('m_rekening')->where('m_rekening_code', $id_rekening)
                ->update(['m_rekening_item' => $updatedItems]);