app/Http/Controllers/Controller.php

        if (!empty($counter->first())) {
            if ($counter->first()->app_id_counter_date == Carbon::now()->format('Y-m-d')) {
                $nextCounter = $counter->first()->app_id_counter_value+1;
                $counter->update([
                    'app_id_counter_value' => $nextCounter
                ]);
                $id = $waroengId.Auth::user()->users_id.$date.$nextCounter;
            }else{
                $nextCounter = 1;
                $counter->update([
                    'app_id_counter_value' => $nextCounter,
                    'app_id_counter_date' => Carbon::now()->format('Y-m-d')
                ]);
---
update "app_id_counter" set "app_id_counter_value" = 2 where "ctid" in (select "app_id_counter"."ctid" from "app_id_counter" where ("app_id_counter_m_w_id" = 1 and "app_id_counter_table" = 'rekap_jurnal_umum') limit 1)
update "app_id_counter" set "app_id_counter_value" = 1, "app_id_counter_date" = '2023-11-08' where "ctid" in (select "app_id_counter"."ctid" from "app_id_counter" where ("app_id_counter_m_w_id" = 1 and "app_id_counter_table" = 'rekap_jurnal_umum') limit 1)